console.log('number' + 3 + 3); // Об'єднання рядка 'number' з числом 3 i потiм знову з чистом 3, результат string 'number33'

console.log(null + 3); // JavaScript приводить null до числового типу 0, i потiм складає 0 + 3, результат 3
 
console.log(5 && "qwerty"); // Обидва операнди є істинним значенням тому результат "qwerty"

console.log(+'40' + +'2' + "hillel"); // Спочатку буде додавання чисел 40 і 2, а потім об'єднання рядка 42 з hillel, результат 42hillel

console.log('10' - 5 === 6); // Оператор віднімання - автоматично перетворює операнди на числа, тому буде 5 === 6. Це порівняння значень, 5 не дорівнює 6, результат false.

console.log(true + false); // true перетворюється на число 1, а false перетворюється на число 0, потім вони складаються і результат 1

console.log('4px' - 3); // Перетворення рядка '4px' у число неможливе, тому що рядок містить неправильний формат числа, результат NaN (Not a Number)

console.log('4' - 3); // Рядок '4' перетвориться у число 4, а 4 - 3 дорівнює 1, тому результат 1

console.log('6' + 3 ** 0); // Спершу виконається операція 3 в піднесенні до нульової ступені, що дорівнює 1, потім рядок '6' об'єднується з 1, результат '61'

console.log(12 / '6'); // Так як тут ділення, '6' перетворюється у число 6, і потім 12 поділити на 6, результат 2

console.log('10' + (5 === 6)); // 5 не дорівнює 6 тому буде false, і потім 10 об'єднується з false, результат 10false

console.log(null == ''); // null не рівний порожньому рядку '' тому результат false

console.log(3 ** (9 / 3)); // Cпочатку виоконається ділення 9 на 3, а потім піднесення 3 у третю ступінь, результат 27

console.log(!!'false' == !!'true'); // Будь-який непустий рядок розглядається як true. Перше ! змінює true на його протилежне значення false, а друге ! знову змінює false на його протилежне значення true. Отже, !!'false' дорівнює true і таким же чином !!'true' дорівнює true. true дорівнює true тому результат true.

console.log(0 || '0' && 1); // Cпочатку вконується '0' && 1, '0' перетворюється в true, оскільки це не порожній рядок, і виконується коротке зв'язування, результат 1. Потім викоується 0 || 1 де 0 перетворюється в false, але || використовує коротке зв'язування і повертає перше значення, яке є істинним. Оскільки 1 є істинним значенням, результат 1.

console.log((+null == false) < 1); // +null перетворює null на число 0, false також перетворюється на 0, 0 == 0 буде true, true перетворюється на 1 і потім порівнює його 1, 1 не меньше ніж 1, тому результат false

console.log(false && true || true); //false && true буде false оскільки один з операндів є false. false || true буде true оскільки один з операндів є true, результат true

console.log(false && (false || true)); //false || true буде true оскільки один з операндів є true. false && true буде false оскільки один з операндів є false, результат false.

console.log((+null == false) < 1 ** 5); // +null перетворить null в число 0, false перетвориться в 0, 0 == 0 буде true тому що вони рівні, 1 ** 5 піднесе число 1 до степеня 5, отримуючи 1. Отримаємо true < 1, true перетворюється на 1, 1 не меньше ніж 1, результат false